# snippet evaluation file generated by generate_snippet_tests.py
sage: G = TransitiveGroup(4, 2)
sage: G.id()
[4, 2]
sage: G.order()
4
sage: G.is_cyclic()
False
sage: G.is_abelian()
True
sage: G.is_solvable()
True
sage: G.degree()
4
sage: G.transitive_number()
2
sage: G.is_primitive()
False
sage: SymmetricGroup(4).centralizer(G).order()
4
sage: G.gens()
((1,4)(2,3), (1,2)(3,4))
sage: G.conjugacy_classes()
[Conjugacy class of () in Transitive group number 2 of degree 4,
 Conjugacy class of (1,2)(3,4) in Transitive group number 2 of degree 4,
 Conjugacy class of (1,3)(2,4) in Transitive group number 2 of degree 4,
 Conjugacy class of (1,4)(2,3) in Transitive group number 2 of degree 4]
sage: G.character_table()
[ 1  1  1  1]
[ 1 -1 -1  1]
[ 1  1 -1 -1]
[ 1 -1  1 -1]
sage: 