# snippet evaluation file generated by generate_snippet_tests.py
sage: G = TransitiveGroup(11, 5)
sage: G.id()
[660, 13]
sage: G.order()
660
sage: G.is_cyclic()
False
sage: G.is_abelian()
False
sage: G.is_solvable()
False
sage: G.degree()
11
sage: G.transitive_number()
5
sage: G.is_primitive()
True
sage: SymmetricGroup(11).centralizer(G).order()
1
sage: G.gens()
((1,2,3,4,5,6,7,8,9,10,11), (2,10)(3,4)(5,9)(6,7))
sage: G.conjugacy_classes()
[Conjugacy class of () in Transitive group number 5 of degree 11,
 Conjugacy class of (3,4)(5,7)(6,9)(8,11) in Transitive group number 5 of degree 11,
 Conjugacy class of (3,5,8)(4,11,7)(6,9,10) in Transitive group number 5 of degree 11,
 Conjugacy class of (2,3,6,9,4)(5,10,7,8,11) in Transitive group number 5 of degree 11,
 Conjugacy class of (2,3,10,9,7)(4,5,11,8,6) in Transitive group number 5 of degree 11,
 Conjugacy class of (1,2)(3,4,8,7,5,11)(6,9,10) in Transitive group number 5 of degree 11,
 Conjugacy class of (1,2,3,4,5,6,7,8,9,10,11) in Transitive group number 5 of degree 11,
 Conjugacy class of (1,2,3,6,10,7,5,9,11,8,4) in Transitive group number 5 of degree 11]
sage: G.character_table()
[                                                                                            1                                                                                             1                                                                                             1                                                                                             1                                                                                             1                                                                                             1                                                                                             1                                                                                             1]
[                                                                                            5                                                                                             1                                                                                            -1                                                                                             0                                                                                             0                                                                                             1    -zeta55^34 + zeta55^25 - zeta55^23 + zeta55^20 + zeta55^15 - zeta55^12 + zeta55^5 - zeta55 zeta55^34 - zeta55^25 + zeta55^23 - zeta55^20 - zeta55^15 + zeta55^12 - zeta55^5 + zeta55 - 1]
[                                                                                            5                                                                                             1                                                                                            -1                                                                                             0                                                                                             0                                                                                             1 zeta55^34 - zeta55^25 + zeta55^23 - zeta55^20 - zeta55^15 + zeta55^12 - zeta55^5 + zeta55 - 1    -zeta55^34 + zeta55^25 - zeta55^23 + zeta55^20 + zeta55^15 - zeta55^12 + zeta55^5 - zeta55]
[                                                                                           10                                                                                            -2                                                                                             1                                                                                             0                                                                                             0                                                                                             1                                                                                            -1                                                                                            -1]
[                                                                                           10                                                                                             2                                                                                             1                                                                                             0                                                                                             0                                                                                            -1                                                                                            -1                                                                                            -1]
[                                                                                           11                                                                                            -1                                                                                            -1                                                                                             1                                                                                             1                                                                                            -1                                                                                             0                                                                                             0]
[                                                                                           12                                                                                             0                                                                                             0                                                                         zeta55^33 + zeta55^22                                                                    -zeta55^33 - zeta55^22 - 1                                                                                             0                                                                                             1                                                                                             1]
[                                                                                           12                                                                                             0                                                                                             0                                                                    -zeta55^33 - zeta55^22 - 1                                                                         zeta55^33 + zeta55^22                                                                                             0                                                                                             1                                                                                             1]
sage: 