# snippet evaluation file generated by generate_snippet_tests.py
sage: G = TransitiveGroup(11, 6)
sage: G.id()
[0;31m---------------------------------------------------------------------------[0m
[0;31mGAPError[0m                                  Traceback (most recent call last)
Cell [0;32mIn[151], line 1[0m
[0;32m----> 1[0m [43mG[49m[38;5;241;43m.[39;49m[43mid[49m[43m([49m[43m)[49m

File [0;32m/usr/share/miniconda/envs/lmfdb/lib/python3.12/site-packages/sage/groups/perm_gps/permgroup.py:2333[0m, in [0;36mPermutationGroup_generic.id[0;34m(self)[0m
[1;32m   2321[0m [38;5;28;01mdef[39;00m[38;5;250m [39m[38;5;21mid[39m([38;5;28mself[39m):
[1;32m   2322[0m [38;5;250m    [39m[38;5;124;03m"""[39;00m
[1;32m   2323[0m [38;5;124;03m    Return the ID code of this group, which is a list of two integers.[39;00m
[1;32m   2324[0m 
[0;32m   (...)[0m
[1;32m   2331[0m [38;5;124;03m        [12, 4][39;00m
[1;32m   2332[0m [38;5;124;03m    """[39;00m
[0;32m-> 2333[0m     [38;5;28;01mreturn[39;00m [38;5;28;43mself[39;49m[38;5;241;43m.[39;49m[43mgroup_id[49m[43m([49m[43m)[49m

File [0;32m/usr/share/miniconda/envs/lmfdb/lib/python3.12/site-packages/sage/groups/perm_gps/permgroup.py:2319[0m, in [0;36mPermutationGroup_generic.group_id[0;34m(self)[0m
[1;32m   2308[0m [38;5;28;01mdef[39;00m[38;5;250m [39m[38;5;21mgroup_id[39m([38;5;28mself[39m):
[1;32m   2309[0m [38;5;250m    [39m[38;5;124;03m"""[39;00m
[1;32m   2310[0m [38;5;124;03m    Return the ID code of this group, which is a list of two integers.[39;00m
[1;32m   2311[0m 
[0;32m   (...)[0m
[1;32m   2316[0m [38;5;124;03m        [12, 4][39;00m
[1;32m   2317[0m [38;5;124;03m    """[39;00m
[0;32m-> 2319[0m     [38;5;28;01mreturn[39;00m [Integer(n) [38;5;28;01mfor[39;00m n [38;5;129;01min[39;00m [38;5;28;43mself[39;49m[38;5;241;43m.[39;49m[43m_libgap_[49m[43m([49m[43m)[49m[38;5;241;43m.[39;49m[43mIdGroup[49m[43m([49m[43m)[49m]

File [0;32m/usr/share/miniconda/envs/lmfdb/lib/python3.12/site-packages/sage/libs/gap/element.pyx:2637[0m, in [0;36msage.libs.gap.element.GapElement_MethodProxy.__call__ (build/cythonized/sage/libs/gap/element.c:27120)[0;34m()[0m
[1;32m   2635[0m     return GapElement_Function.__call__(self, * ([self.first_argument] + list(args)))
[1;32m   2636[0m else:
[0;32m-> 2637[0m     return GapElement_Function.__call__(self, self.first_argument)
[1;32m   2638[0m 
[1;32m   2639[0m 

File [0;32m/usr/share/miniconda/envs/lmfdb/lib/python3.12/site-packages/sage/libs/gap/element.pyx:2507[0m, in [0;36msage.libs.gap.element.GapElement_Function.__call__ (build/cythonized/sage/libs/gap/element.c:26327)[0;34m()[0m
[1;32m   2505[0m try:
[1;32m   2506[0m     sig_GAP_Enter()
[0;32m-> 2507[0m     sig_on()
[1;32m   2508[0m     if n == 0:
[1;32m   2509[0m         result = GAP_CallFunc0Args(self.value)

[0;31mGAPError[0m: Error, the group identification for groups of size 7920 is not available
sage: G.order()
7920
sage: G.is_cyclic()
False
sage: G.is_abelian()
False
sage: G.is_solvable()
False
sage: G.degree()
11
sage: G.transitive_number()
6
sage: G.is_primitive()
True
sage: SymmetricGroup(11).centralizer(G).order()
1
sage: G.gens()
((1,2,3,4,5,6,7,8,9,10,11), (1,3,9,5,4)(2,6,7,10,8), (2,6,10,7)(3,9,4,5))
sage: G.conjugacy_classes()
[Conjugacy class of () in Transitive group number 6 of degree 11,
 Conjugacy class of (2,5)(3,8)(4,6)(9,11) in Transitive group number 6 of degree 11,
 Conjugacy class of (2,3,5,8)(4,9,6,11) in Transitive group number 6 of degree 11,
 Conjugacy class of (2,4,3,9,5,6,8,11)(7,10) in Transitive group number 6 of degree 11,
 Conjugacy class of (2,11,8,6,5,9,3,4)(7,10) in Transitive group number 6 of degree 11,
 Conjugacy class of (1,2,7,5,3,11,4,6,8,10,9) in Transitive group number 6 of degree 11,
 Conjugacy class of (1,9,10,8,6,4,11,3,5,7,2) in Transitive group number 6 of degree 11,
 Conjugacy class of (1,7,2)(3,9,10)(5,6,8) in Transitive group number 6 of degree 11,
 Conjugacy class of (1,8,7,5,2,6)(3,10,9)(4,11) in Transitive group number 6 of degree 11,
 Conjugacy class of (1,9,3,11,2)(4,7,8,6,5) in Transitive group number 6 of degree 11]
sage: G.character_table()
[                                                           1                                                            1                                                            1                                                            1                                                            1                                                            1                                                            1                                                            1                                                            1                                                            1]
[                                                          10                                                            2                                                            2                                                            0                                                            0                                                           -1                                                           -1                                                            1                                                           -1                                                            0]
[                                                          10                                                           -2                                                            0                                       -zeta88^33 - zeta88^11                                        zeta88^33 + zeta88^11                                                           -1                                                           -1                                                            1                                                            1                                                            0]
[                                                          10                                                           -2                                                            0                                        zeta88^33 + zeta88^11                                       -zeta88^33 - zeta88^11                                                           -1                                                           -1                                                            1                                                            1                                                            0]
[                                                          11                                                            3                                                           -1                                                           -1                                                           -1                                                            0                                                            0                                                            2                                                            0                                                            1]
[                                                          16                                                            0                                                            0                                                            0                                                            0    -zeta88^36 - zeta88^20 + zeta88^16 - zeta88^12 - zeta88^4 zeta88^36 + zeta88^20 - zeta88^16 + zeta88^12 + zeta88^4 - 1                                                           -2                                                            0                                                            1]
[                                                          16                                                            0                                                            0                                                            0                                                            0 zeta88^36 + zeta88^20 - zeta88^16 + zeta88^12 + zeta88^4 - 1    -zeta88^36 - zeta88^20 + zeta88^16 - zeta88^12 - zeta88^4                                                           -2                                                            0                                                            1]
[                                                          44                                                            4                                                            0                                                            0                                                            0                                                            0                                                            0                                                           -1                                                            1                                                           -1]
[                                                          45                                                           -3                                                            1                                                           -1                                                           -1                                                            1                                                            1                                                            0                                                            0                                                            0]
[                                                          55                                                           -1                                                           -1                                                            1                                                            1                                                            0                                                            0                                                            1                                                           -1                                                            0]
sage: 