# snippet evaluation file generated by generate_snippet_tests.py
sage: x = polygen(QQ);  K.<a> = NumberField(x)
sage: K.defining_polynomial()
x
sage: K.degree()
1
sage: K.signature()
(1, 0)
sage: K.disc()
1
sage: K.disc().support()
[]
sage: K.automorphisms()
[
Ring endomorphism of Number Field in a with defining polynomial x
  Defn: 0 |--> 0
]
sage: K.integral_basis()
[1]
sage: K.class_group().invariants()
()
sage: UK = K.unit_group()
sage: UK.rank()
0
sage: UK.torsion_generator()
u
sage: UK.fundamental_units()
[]
sage: K.regulator()
1.00000000000000
sage: x = polygen(QQ);  K.<a> = NumberField(x)
sage: DK = K.disc(); r1,r2 = K.signature(); RK = K.regulator();  RR = RK.parent()
sage: hK = K.class_number(); wK = K.unit_group().torsion_generator().order();
sage: 2^r1 * (2*RR(pi))^r2 * RK * hK / (wK * RR(sqrt(abs(DK))))  
1.00000000000000
sage: K.subfields()[1:-1]
[

]
sage: K.galois_group(type='pari')
<ipython-input-57-70c79b25ed84>:1: DeprecationWarning: the different Galois types have been merged into one class
See https://github.com/sagemath/sage/issues/28782 for details.
  K.galois_group(type='pari')
Galois group 1T1 (S1) with order 1 of x
sage: p = 7; [(e, pr.norm().valuation(p)) for pr,e in K.factor(p)]
[(1, 1)]
sage: 