# snippet evaluation file generated by generate_snippet_tests.py
sage: Prec = 100  # Default precision of 100
sage: Q2 = Qp(2, Prec); x = polygen(QQ)
sage: L.<t> = Q2.extension(x^2 + x + 1)
sage: K.<a> = L.extension(x^2 + 2*x + 2)
sage: K.defining_polynomial()
(1 + O(2^100))*x^2 + (2 + O(2^101))*x + 2 + O(2^101)
sage: K.base()
2-adic Unramified Extension Field in t defined by x^2 + x + 1
sage: K.absolute_degree()
4
sage: K.absolute_e()
2
sage: K.absolute_f()
2
sage: K.maximal_unramified_subextension()
2-adic Unramified Extension Field in t defined by x^2 + x + 1
sage: len(K.roots_of_unity())
12
sage: 