# snippet evaluation file generated by generate_snippet_tests.py
sage: E = EllipticCurve([0, -1, 1, 0, 0])
sage: E.short_weierstrass_model()
Elliptic Curve defined by y^2 = x^3 - 432*x + 8208 over Rational Field
sage: E.gens()
[]
sage: E.torsion_subgroup().gens()
((0 : 0 : 1),)
sage: E.integral_points()
[(0 : -1 : 1), (1 : -1 : 1)]
sage: E.conductor().factor()
11
sage: E.discriminant().factor()
-1 * 11
sage: E.j_invariant().factor()
-1 * 2^12 * 11^-1
sage: E.has_cm()
False
sage: E.rank()
0
sage: E.analytic_rank()
0
sage: E.regulator()
1.00000000000000
sage: E.period_lattice().omega()
6.34604652139777
sage: E.tamagawa_numbers()
[1]
sage: E.torsion_order()
5
sage: E.sha().an_numerical()
1.00000000000000
sage: r = E.rank();
sage: E.lseries().dokchitser().derivative(1,r)/r.factorial()
0.253841860855911
sage: E = EllipticCurve([0, -1, 1, 0, 0]); r = E.rank(); ar = E.analytic_rank(); assert r == ar;
sage: Lr1 = E.lseries().dokchitser().derivative(1,r)/r.factorial(); sha = E.sha().an_numerical();
sage: omega = E.period_lattice().omega(); reg = E.regulator(); tam = E.tamagawa_product(); tor = E.torsion_order();
sage: assert r == ar; print("analytic sha: " + str(RR(Lr1) * tor^2 / (omega * reg * tam)))
analytic sha: 1.00000000000000
sage: E.q_eigenform(20)
q - 2*q^2 - q^3 + 2*q^4 + q^5 + 2*q^6 - 2*q^7 - 2*q^9 - 2*q^10 + q^11 - 2*q^12 + 4*q^13 + 4*q^14 - q^15 - 4*q^16 - 2*q^17 + 4*q^18 + O(q^20)
sage: E.modular_degree()
5
sage: E.local_data()
[Local data at Principal ideal (11) of Integer Ring:
 Reduction type: bad split multiplicative
 Local minimal model: Elliptic Curve defined by y^2 + y = x^3 - x^2 over Rational Field
 Minimal discriminant valuation: 1
 Conductor exponent: 1
 Kodaira Symbol: I1
 Tamagawa Number: 1]
sage: rho = E.galois_representation(); [rho.image_type(p) for p in rho.non_surjective()]
['The image is meta-cyclic inside a Borel subgroup as there is a 5-torsion point on the curve.']
sage: 