\\ snippet evaluation file generated by generate_snippet_tests.py
gp> E = ellinit([0, 0, 1, -1, 0])
[0, 0, 1, -1, 0, 0, -2, 1, -1, 48, -216, 37, 110592/37, Vecsmall([1]), [Vecsmall([128, 1])], [0, 0, 0, 0, 0, 0, 0, 0]]
gp> E.gen
[[0, 0]]
gp> elltors(E)
[1, [], []]
gp> ellglobalred(E)[1]
37
gp> E.disc
37
gp> E.j
110592/37
gp> ellheight(E)
-0.99654220763736714794656344357154143576
gp> [lower,upper] = ellrank(E)
[1, 1, 0, [[-1, 0]]]
gp> ellanalyticrank(E)
[1, 0.30599977383405230182048368332167647445]
gp> G = E.gen \\ if available
[[0, 0]]
gp> matdet(ellheightmatrix(E,G))
0.051111408239968840235886099756942021610
gp> if(E.disc>0,2,1)*E.omega[1]
5.9869172924639192596640199589050163556
gp> gr=ellglobalred(E); [[gr[4][i,1],gr[5][i][4]] | i<-[1..#gr[4][,1]]]
[[37, 1]]
gp> elltors(E)[1]
1
gp> [r,L1r] = ellanalyticrank(E); L1r/r!
0.30599977383405230182048368332167647445
gp> Ser(ellan(E,20),q)*q
q - 2*q^2 - 3*q^3 + 2*q^4 - 2*q^5 + 6*q^6 - q^7 + 6*q^9 + 4*q^10 - 5*q^11 - 6*q^12 - 2*q^13 + 2*q^14 + 6*q^15 - 4*q^16 - 12*q^18 - 4*q^20 + O(q^21)
gp> ellmoddegree(E)
2
gp> ellglobalred(E)[5]
[[1, 5, 0, 1]]
gp> 