\\ snippet evaluation file generated by generate_snippet_tests.py
gp> E = ellinit([0, 0, 1, -1, 0])
[0, 0, 1, -1, 0, 0, -2, 1, -1, 48, -216, 37, 110592/37, Vecsmall([1]), [Vecsmall([128, 1])], [0, 0, 0, 0, 0, 0, 0, 0]]
gp> E.gen
[[0, 0]]
gp> elltors(E)
[1, [], []]
gp> ellglobalred(E)[1]
37
gp> E.disc
37
gp> E.j
110592/37
gp> ellheight(E)
-0.99654220763736714794656344357154143576
gp> [lower,upper] = ellrank(E)
[1, 1, 0, [[-1, 0]]]
gp> ellanalyticrank(E)
[1, 0.30599977383405230182048368332167647445]
gp> G = E.gen \\ if available
[[0, 0]]
gp> matdet(ellheightmatrix(E,G))
0.051111408239968840235886099756942021610
gp> if(E.disc>0,2,1)*E.omega[1]
5.9869172924639192596640199589050163556
gp> gr=ellglobalred(E); [[gr[4][i,1],gr[5][i][4]] | i<-[1..#gr[4][,1]]]
[[37, 1]]
gp> elltors(E)[1]
1
gp> [r,L1r] = ellanalyticrank(E); L1r/r!
0.30599977383405230182048368332167647445
gp> [mf,F] = mffromell(E)
[[[37, 2, [[[1, [0]], [1, [], []], [[]~, Vecsmall([])], [[], [], [;], [], [], []], [;]], []~, 1, t - 1], 0], [], [[[Vecsmall([9]), [37, 2, [[[1, [0]], [1, [], []], [[]~, Vecsmall([])], [[], [], [;], [], [], []], [;]], []~, 1, t - 1], y]], [[[1, [0]], [1, [], []], [[]~, Vecsmall([])], [[], [], [;], [], [], []], [;]], []~, 1, t - 1]], [[Vecsmall([20]), [37, 2, [[[1, [0]], [1, [], []], [[]~, Vecsmall([])], [[], [], [;], [], [], []], [;]], []~, 1, t - 1], y]], Vecsmall([2, 2, 37]), [[Vecsmall([9]), [37, 2, [[[1, [0]], [1, [], []], [[]~, Vecsmall([])], [[], [], [;], [], [], []], [;]], []~, 1, t - 1], y]], [[[1, [0]], [1, [], []], [[]~, Vecsmall([])], [[], [], [;], [], [], []], [;]], []~, 1, t - 1]]]], Vecsmall([1, 2]), [Vecsmall([2, 3]), [[2, 1; 1, 1], 2, 1, 0], [0, 0; 2, -2; -2, 4]], [0, 0, 0, 0, 0]], [[Vecsmall([5]), [37, 2, [[[1, [0]], [1, [], []], [[]~, Vecsmall([])], [[], [], [;], [], [], []], [;]], []~, 1, t - 1], y]], [0, 0, 1, -1, 0, 0, -2, 1, -1, 48, -216, 37, 110592/37, Vecsmall([1]), [Vecsmall([128, 1])], [[2.9934586462319596298320099794525081778, -2.4513893819867900608542248318665252253*I], 0, [0.83756543528332303544481089907503024040, 0.26959443640544455826293795134926000405, -1.1071598716887675937077488504242902445, 1.3767543080942121519706868017735502485, 1.9447253069720906291525597494993204849, 0.56797099887787847718187294772577023635]~, [-1.1536613682079794870404572293106210406, -1.0509745834909744209136981100086967207], [[0, 0]], [37, 1, Mat([37, 1]), [[1, 5, 0, 1]]], [-1, Vecsmall([1])], [[]~]]]], [0, -1/2]~]
gp> Ser(mfcoefs(mf,20),q)
  ***   at top-level: Ser(mfcoefs(mf,20),q)
  ***                 ^---------------------
  *** Ser: incorrect type in Ser (t_MAT).
gp> Ser(ellan(E,20),q)*q
q - 2*q^2 - 3*q^3 + 2*q^4 - 2*q^5 + 6*q^6 - q^7 + 6*q^9 + 4*q^10 - 5*q^11 - 6*q^12 - 2*q^13 + 2*q^14 + 6*q^15 - 4*q^16 - 12*q^18 - 4*q^20 + O(q^21)
gp> ellmoddegree(E)
2
gp> ellglobalred(E)[5]
[[1, 5, 0, 1]]
gp> 