\\ snippet evaluation file generated by generate_snippet_tests.py
gp> E = ellinit([0, -1, 1, 0, 0])
[0, -1, 1, 0, 0, -4, 0, 1, -1, 16, -152, -11, -4096/11, Vecsmall([1]), [Vecsmall([128, -1])], [0, 0, 0, 0, 0, 0, 0, 0]]
gp> E.gen
[]
gp> elltors(E)
[5, [5], [[0, 0]]]
gp> ellglobalred(E)[1]
11
gp> E.disc
-11
gp> E.j
-4096/11
gp> ellheight(E)
-1.1127287973354532519893939280725810109
gp> [lower,upper] = ellrank(E)
[0, 0, 0, []]
gp> ellanalyticrank(E)
[0, 0.25384186085591068433775892335090946104]
gp> G = E.gen \\ if available
[]
gp> matdet(ellheightmatrix(E,G))
1
gp> if(E.disc>0,2,1)*E.omega[1]
6.3460465213977671084439730837727365261
gp> gr=ellglobalred(E); [[gr[4][i,1],gr[5][i][4]] | i<-[1..#gr[4][,1]]]
[[11, 1]]
gp> elltors(E)[1]
5
gp> [r,L1r] = ellanalyticrank(E); L1r/r!
0.25384186085591068433775892335090946104
gp> Ser(ellan(E,20),q)*q
q - 2*q^2 - q^3 + 2*q^4 + q^5 + 2*q^6 - 2*q^7 - 2*q^9 - 2*q^10 + q^11 - 2*q^12 + 4*q^13 + 4*q^14 - q^15 - 4*q^16 - 2*q^17 + 4*q^18 + 2*q^20 + O(q^21)
gp> ellmoddegree(E)
1/5
gp> ellglobalred(E)[5]
[[1, 5, 0, 1]]
gp> 