\\ snippet evaluation file generated by generate_snippet_tests.py
gp> E = ellinit([0, -1, 1, 0, 0])
[0, -1, 1, 0, 0, -4, 0, 1, -1, 16, -152, -11, -4096/11, Vecsmall([1]), [Vecsmall([128, -1])], [0, 0, 0, 0, 0, 0, 0, 0]]
gp> E.gen
[]
gp> elltors(E)
[5, [5], [[0, 0]]]
gp> ellglobalred(E)[1]
11
gp> E.disc
-11
gp> E.j
-4096/11
gp> ellheight(E)
-1.1127287973354532519893939280725810109
gp> [lower,upper] = ellrank(E)
[0, 0, 0, []]
gp> ellanalyticrank(E)
[0, 0.25384186085591068433775892335090946104]
gp> G = E.gen \\ if available
[]
gp> matdet(ellheightmatrix(E,G))
1
gp> if(E.disc>0,2,1)*E.omega[1]
6.3460465213977671084439730837727365261
gp> gr=ellglobalred(E); [[gr[4][i,1],gr[5][i][4]] | i<-[1..#gr[4][,1]]]
[[11, 1]]
gp> elltors(E)[1]
5
gp> [r,L1r] = ellanalyticrank(E); L1r/r!
0.25384186085591068433775892335090946104
gp> [mf,F] = mffromell(E)
[[[11, 2, [[[1, [0]], [1, [], []], [[]~, Vecsmall([])], [[], [], [;], [], [], []], [;]], []~, 1, t - 1], 0], [], [[[Vecsmall([9]), [11, 2, [[[1, [0]], [1, [], []], [[]~, Vecsmall([])], [[], [], [;], [], [], []], [;]], []~, 1, t - 1], y]], [[[1, [0]], [1, [], []], [[]~, Vecsmall([])], [[], [], [;], [], [], []], [;]], []~, 1, t - 1]]], Vecsmall([1]), [Vecsmall([2]), [Mat(1), 1, 1, 0], [0; 1]], [0, 0, 0, 0, 0]], [[Vecsmall([5]), [11, 2, [[[1, [0]], [1, [], []], [[]~, Vecsmall([])], [[], [], [;], [], [], []], [;]], []~, 1, t - 1], y]], [0, -1, 1, 0, 0, -4, 0, 1, -1, 16, -152, -11, -4096/11, Vecsmall([1]), [Vecsmall([128, -1])], [[6.3460465213977671084439730837727365261, 3.1730232606988835542219865418863682630 - 1.4588166169384952293308896129036752572*I], 0, [-0.41964337760708056627592628232664330021, 0.70982168880354028313796314116332165011 + 0.30314536460359968462967109851401150148*I, 0.70982168880354028313796314116332165011 - 0.30314536460359968462967109851401150148*I, 0.60629072920719936925934219702802300295*I, -1.1294650664106208494138894234899649503 + 0.30314536460359968462967109851401150148*I, -1.1294650664106208494138894234899649503 - 0.30314536460359968462967109851401150148*I]~, 0, [], [11, 1, Mat([11, 1]), [[1, 5, 0, 1]]], [1, Vecsmall([-1])], [[]~]]]], [1]~]
gp> Ser(mfcoefs(mf,20),q)
  ***   at top-level: Ser(mfcoefs(mf,20),q)
  ***                 ^---------------------
  *** Ser: incorrect type in Ser (t_MAT).
gp> Ser(ellan(E,20),q)*q
q - 2*q^2 - q^3 + 2*q^4 + q^5 + 2*q^6 - 2*q^7 - 2*q^9 - 2*q^10 + q^11 - 2*q^12 + 4*q^13 + 4*q^14 - q^15 - 4*q^16 - 2*q^17 + 4*q^18 + 2*q^20 + O(q^21)
gp> ellmoddegree(E)
1/5
gp> ellglobalred(E)[5]
[[1, 5, 0, 1]]
gp> 