# snippet evaluation file generated by generate_snippet_tests.py
sage: R.<x> = PolynomialRing(QQ);  K.<a> = NumberField(R([3, -1, 1]))
sage: E = EllipticCurve([K([0,0]),K([-1,0]),K([1,0]),K([-7820,0]),K([-263580,0])])
sage: E.is_global_minimal_model()
True
sage: E.conductor()
Fractional ideal (-2*a + 1)
sage: E.conductor().norm()
11
sage: E.discriminant()
-11
sage: E.discriminant().norm()
121
sage: E.j_invariant()
-52893159101157376/11
sage: E.has_cm(), E.cm_discriminant()
(False, 0)
sage: E.rank()
0
sage: gens = E.gens(); gens
[]
sage: [P.height() for P in gens]
[]
sage: E.regulator_of_points(gens)
1.00000000000000
sage: T = E.torsion_subgroup(); T.invariants()
()
sage: T.order()
1
sage: T.gens()
()
sage: E.local_data()
[Local data at Fractional ideal (-2*a + 1):
 Reduction type: bad split multiplicative
 Local minimal model: Elliptic Curve defined by y^2 + y = x^3 + (-1)*x^2 + (-7820)*x + (-263580) over Number Field in a with defining polynomial x^2 - x + 3
 Minimal discriminant valuation: 2
 Conductor exponent: 1
 Kodaira Symbol: I2
 Tamagawa Number: 2]
sage: 