\\ snippet evaluation file generated by generate_snippet_tests.py
gp> K = nfinit(Polrev([3, -1, 1]));
gp> E = ellinit([Polrev([0,0]),Polrev([-1,0]),Polrev([1,0]),Polrev([-7820,0]),Polrev([-263580,0])], K);
gp> ellglobalred(E)[1]

[11 5]

[ 0 1]

gp> idealnorm(ellglobalred(E)[1])
  ***   too few arguments: ...alnorm(ellglobalred(E)[1])
  ***                                                  ^-
gp> E.disc
Mod(-11, x^2 - x + 3)
gp> norm(E.disc)
121
gp> E.j
Mod(-52893159101157376/11, x^2 - x + 3)
gp> T = elltors(E); T[2]
[]
gp> T[1]
1
gp> T[3]
[]
gp> 