\\ snippet evaluation file generated by generate_snippet_tests.py
gp> K = nfinit(Polrev([1, -1, 1]));
gp> E = ellinit([Polrev([0,0]),Polrev([0,0]),Polrev([1,0]),Polrev([0,0]),Polrev([0,0])], K);
gp> ellglobalred(E)[1]

[9 0]

[0 9]

gp> idealnorm(ellglobalred(E)[1])
  ***   too few arguments: ...alnorm(ellglobalred(E)[1])
  ***                                                  ^-
gp> E.disc
Mod(-27, x^2 - x + 1)
gp> norm(E.disc)
729
gp> E.j
Mod(0, x^2 - x + 1)
gp> T = elltors(E); T[2]
[3, 3]
gp> T[1]
9
gp> T[3]
[[Mod(-1, x^2 - x + 1), Mod(-x, x^2 - x + 1)], [Mod(0, x^2 - x + 1), Mod(-1, x^2 - x + 1)]]
gp> 