# snippet evaluation file generated by generate_snippet_tests.py
sage: R.<x> = PolynomialRing(QQ);  K.<a> = NumberField(R([1, -1, 1]))
sage: E = EllipticCurve([K([0,0]),K([0,0]),K([1,0]),K([0,0]),K([0,0])])
sage: E.is_global_minimal_model()
True
sage: E.conductor()
Fractional ideal (9)
sage: E.conductor().norm()
81
sage: E.discriminant()
-27
sage: E.discriminant().norm()
729
sage: E.j_invariant()
0
sage: E.has_cm(), E.cm_discriminant()
(True, -3)
sage: E.rank()
0
sage: gens = E.gens(); gens
[]
sage: [P.height() for P in gens]
[]
sage: E.regulator_of_points(gens)
1.00000000000000
sage: T = E.torsion_subgroup(); T.invariants()
(3, 3)
sage: T.order()
9
sage: T.gens()
((-1 : -a : 1), (0 : -1 : 1))
sage: E.local_data()
[Local data at Fractional ideal (a + 1):
 Reduction type: bad additive
 Local minimal model: Elliptic Curve defined by y^2 + y = x^3 over Number Field in a with defining polynomial x^2 - x + 1
 Minimal discriminant valuation: 6
 Conductor exponent: 4
 Kodaira Symbol: IV
 Tamagawa Number: 3]
sage: 