prompt:
  magma: 'magma'
  sage:  'sage'
  oscar: 'oscar'

logo:
  magma: <img src = "https://i.stack.imgur.com/0468s.png" width="50px">
  sage: <img src ="https://www.sagemath.org/pix/sage_logo_new.png" width = "50px">
  oscar: <img src = "https://oscar-system.github.io/Oscar.jl/stable/assets/logo.png" width="50px">

comment:
  sage: |
    #
  magma: |
    //
  oscar: |
    #

not-implemented:
  sage: |
    # (not yet implemented)
  magma: |
    // (not yet implemented)
  oscar: |
    # (not yet implemented)

frontmatter:
  all: |
    {lang} code for working with transitive group {label}

gg:
  comment: Define the Galois group
  magma: G := TransitiveGroup({n}, {t});
  sage: G = TransitiveGroup({n}, {t})  
  oscar: G = transitive_group({n}, {t})

n:
  comment: Degree
  magma: t, n := TransitiveGroupIdentification(G); n;
  sage: G.degree()
  oscar: degree(G)

t:
  comment: Transitive number
  magma: t, n := TransitiveGroupIdentification(G); t;
  sage: G.transitive_number()

primitive:
  comment:  Determine if group is primitive
  magma: IsPrimitive(G);
  sage: G.is_primitive()
  oscar: is_primitive(G)

even:
  comment: Parity
  magma: IsEven(G);
  oscar: is_even(G)

nilpotent:
  comment: Nilpotency class
  magma: NilpotencyClass(G);
  oscar: if is_nilpotent(G) nilpotency_class(G) end

auts:
  comment: Order of the centralizer of G in S_n
  magma: Order(Centralizer(SymmetricGroup(n), G));
  sage: SymmetricGroup({n}).centralizer(G).order()
  oscar:  order(centralizer(symmetric_group({n}), G)[1])

gens:
  comment: Generators
  magma: Generators(G);
  sage: G.gens()
  oscar: gens(G)

ccs:
  comment: Conjugacy classes
  magma: ConjugacyClasses(G);
  sage: G.conjugacy_classes()
  oscar: conjugacy_classes(G)

order:
  comment: Order
  magma: Order(G);
  sage: G.order()
  oscar: order(G)

cyclic:
  comment: Determine if group is cyclic
  magma: IsCyclic(G);
  sage: G.is_cyclic()
  oscar: is_cyclic(G)

abelian:
  comment: Determine if group is abelian
  magma: IsAbelian(G);
  sage: G.is_abelian()
  oscar: is_abelian(G)

solvable:
  comment: Determine if group is solvable
  magma: IsSolvable(G);
  sage: G.is_solvable()
  oscar: is_solvable(G)

id:
  comment: Abstract group ID
  magma: IdentifyGroup(G);
  sage: G.id()

char_table:
  comment: Character table
  magma: CharacterTable(G);
  sage: G.character_table()
  oscar: character_table(G)


# specify which code snippets to test
snippet_test:
  test4T2: 
    label: 4T2
    url: GaloisGroup/4T2/download/{lang}
  test11T5: 
    label: 11T5
    url: GaloisGroup/11T5/download/{lang}
